{
    "How are you?": "Hello! I'm just a computer program, so I don't have feelings, but I'm here and ready to assist you. How can I help you today?",
    "Can u tell me a random fact?": "Honey never spoils. Archaeologists have found pots of honey in ancient Egyptian tombs that are over 3,000 years old and still perfectly edible.",
    "Hi": "Hello! How can I assist you today? If you have any questions or if there's something specific you'd like help with, feel free to let me know!",
    "what are top 10 places to travel in winter and in summer?": "The best travel destinations can vary based on personal preferences, but here are some popular recommendations for both winter and summer travel:\n\nTop 5 Winter Travel Destinations:\n\nSwitzerland: Experience picturesque snow-covered landscapes, go skiing in the Swiss Alps, and enjoy charming winter villages.\nQuebec City, Canada: Explore the historic architecture, enjoy winter festivals, and wander through the cobblestone streets of Old Quebec.\nHokkaido, Japan: Known for its world-class ski resorts and the famous Sapporo Snow Festival, Hokkaido offers a winter wonderland.\nReykjavik, Iceland: Witness the Northern Lights, relax in geothermal hot springs, and explore the unique winter landscapes.\nAspen, Colorado, USA: A renowned winter destination for skiing and snowboarding, Aspen also offers a vibrant cultural scene.\n\nTop 5 Summer Travel Destinations:\n\nSantorini, Greece: With its stunning beaches, white-washed buildings, and crystal-clear waters, Santorini is a perfect summer getaway.\nBarcelona, Spain: Enjoy the Mediterranean sunshine, explore the city's architecture, and relax on the beaches of Barceloneta.\nQueenstown, New Zealand: In the Southern Hemisphere, Queenstown offers outdoor adventures, lake activities, and breathtaking landscapes during the summer months.\nMaui, Hawaii, USA: With its diverse landscapes, waterfalls, and beautiful beaches, Maui is a fantastic summer destination.\nAmalfi Coast, Italy: Experience the charm of coastal villages, indulge in delicious Italian cuisine, and soak up the sun along the Amalfi Coast.\n\nThese are just a few suggestions, and there are countless other amazing destinations to explore during both winter and summer. Always check current travel conditions, weather forecasts, and any travel restrictions before planning your trip.",
    "bye": "Goodbye! If you ever have more questions or need assistance in the future, feel free to reach out. Safe travels and take care!"
}